Autodesk.Navisworks.Api.Color
Represents a color as three floating-point components (r,g,b) with a normal range 0.0 to 1.0. Immutable.

Autodesk.Navisworks.Api.Color.#ctor(System.Double,System.Double,System.Double)
Create a color from float (r,g,b) components in the range 0 to 1

Autodesk.Navisworks.Api.Color.Add(Autodesk.Navisworks.Api.Color)
Adds two colors to create another color. Same as operator+
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'color' is null
Throws System.ArgumentException:
Argument 'color' has been Disposed

Autodesk.Navisworks.Api.Color.B
Blue color component (in range 0 to 1)
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Color.Black
Returns a Color initialized to black

Autodesk.Navisworks.Api.Color.Blue
Returns a Color initialized to blue

Autodesk.Navisworks.Api.Color.Equals(System.Object)
Determines whether the specified object and the current object refer to the same
underlying native object. Returns false if either object has been disposed.

Autodesk.Navisworks.Api.Color.FromByteRGB(System.Byte,System.Byte,System.Byte)
Create a color from byte (r,g,b) components in the range 0 to 255

Autodesk.Navisworks.Api.Color.G
Green color component (in range 0 to 1)
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Color.GetClampedByteValue(System.Int32)
Return color components as clamped bytes (in range 0 to 255)
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Color.GetHashCode
Serves as a hash function for a particular type.  is suitable for use in hashing algorithms and data structures like a hash table.
Returns: A hash code for the current .

Autodesk.Navisworks.Api.Color.Green
Returns a Color initialized to green

Autodesk.Navisworks.Api.Color.IsBlack
Is color black ?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Color.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.Color.Item(System.Int32)


Autodesk.Navisworks.Api.Color.Multiply(System.Double)
Scales intensity of color by value. Same as operator*
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Color.op_Addition(Autodesk.Navisworks.Api.Color,Autodesk.Navisworks.Api.Color)
Adds the R, G and B values of value1 and value2 and returns the resulting Color

Autodesk.Navisworks.Api.Color.op_Multiply(Autodesk.Navisworks.Api.Color,System.Double)
Multiplies the R, G and B values of color by intensity and returns the Resulting Color

Autodesk.Navisworks.Api.Color.op_Multiply(System.Double,Autodesk.Navisworks.Api.Color)
Multiplies the R, G and B values of color by intensity and returns the Resulting Color

Autodesk.Navisworks.Api.Color.op_Subtraction(Autodesk.Navisworks.Api.Color,Autodesk.Navisworks.Api.Color)
Subtracts the R, G and B values of value2 from value1 and returns the resulting Color

Autodesk.Navisworks.Api.Color.R
Red color component (in range 0 to 1)
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Color.Red
Returns a Color initialized to red

Autodesk.Navisworks.Api.Color.Subtract(Autodesk.Navisworks.Api.Color)
Subtracts color to create another color. Same as operator-
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'color' is null
Throws System.ArgumentException:
Argument 'color' has been Disposed

Autodesk.Navisworks.Api.Color.ToString
Returns a  that represents the current .
Returns: A  that represents the current .

Autodesk.Navisworks.Api.Color.ToVector3D
Convert color to a Vector3D
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Color.White
Returns a Color initialized to white